# Field Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Field Methods
Field Class See Also
---
The Field type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CompatibleUnit | Checks if the specified unit is compatible with the field description. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSpecTypeId | Gets the spec describing the values stored in this field. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SubEntityReadAccessGranted | Checks whether there is read access to subentities storable in this field. |
| SubEntityWriteAccessGranted | Checks whether there is write access to subentities storable in this field. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace